basic-binary-packet.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Basic Binary Packet</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Basic Binary Packet"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-03 20:08:23 EST"/>
<meta name="author" content="Mark Cox"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Basic Binary Packet</h1>

<p>This library provides a simple API for communicating objects over a
stream. The stream protocol is intended to be very simple and
extensible. An implementation of the protocol is written in Common
Lisp.
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Installation</a></li>
<li><a href="#sec-2">2 The API</a>
<ul>
<li><a href="#sec-2-1">2.1 Reading and writing packets</a></li>
<li><a href="#sec-2-2">2.2 Payload</a></li>
<li><a href="#sec-2-3">2.3 Binary Types</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">

<p>The source code for the basic binary packet library can be obtained
from the github repository.
</p>


<pre class="src src-sh">$ git clone &lt;something&gt;
</pre>


<p>
The list of prerequisite libraries required for this library are
</p><ul>
<li><a href="http://common-lisp.net/project/babel/">Babel</a>
</li>
<li><a href="https://github.com/gigamonkey/monkeylib-binary-data">Binary Data</a>
</li>
<li><a href="http://weitz.de/flexi-streams/">Flexi-streams</a>
</li>
<li><a href="http://common-lisp.net/project/ieee-floats/">IEEE Floats</a>
</li>
<li><a href="https://github.com/OdonataResearchLLC/lisp-unit">Lisp Unit</a> (tests only)
</li>
</ul>

<p>These libraries can be obtained using <a href="http://www.quicklisp.org">Quicklisp</a>.
</p>
<p>
An <a href="http://common-lisp.net/project/asdf/">ASDF</a> system definition is provided to load the library in to your
running lisp machine. 
</p>


<pre class="src src-lisp">(asdf:load-system <span style="color: #8b2252;">"basic-binary-packet"</span>)
</pre>


<p>
The tests that accompany the library can be executed with
</p>


<pre class="src src-lisp">(asdf:test-system <span style="color: #8b2252;">"basic-binary-packet"</span>)
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The API</h2>
<div class="outline-text-2" id="text-2">

<p>The protocol used for communicating objects in binary form is a packet
based protocol. The packet sent consists of a magic header, a packet
identifier, a payload byte count and the payload. The magic header is
used to accommodate errors in the processing of a payload. 
</p>
<p>
It is important to note that the packet payload only contains a single
object. This limitation does not preclude sending containers like
lists or arrays that contain many objects.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Reading and writing packets</h3>
<div class="outline-text-3" id="text-2-1">

<p>A payload can be written to a binary stream using the function
<code>WRITE-PACKET-FOR-PAYLOAD</code>
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defun</span> <span style="color: #0000ff;">write-packet-for-payload</span> (stream identifier payload))
</pre>

<p>
The <code>IDENTIFIER</code> argument is an unsigned 32 bit integer that labels
the packet. The <code>PAYLOAD</code> argument is an array of 8 bit unsigned
integers.
</p>
<p>
Reading a packet from a binary stream is performed using the function
<code>MAKE-PACKET-READER-FUNCTION</code>. This function returns a function that
can be used to read payloads from a stream. The returned function is a
state machine that must be repeatedly called until a complete packet
is found. The reason for this approach is to accommodate asynchronous
transmissions.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">let</span> ((fn (make-packet-reader-function)))
  (<span style="color: #7f007f;">defun</span> <span style="color: #0000ff;">byte-available-on-stream</span> (stream)
    (<span style="color: #7f007f;">multiple-value-bind</span> (payload identifier) (funcall fn stream)
      (<span style="color: #7f007f;">when</span> payload
        (payload-received payload identifier)))))
</pre>

<p>
When a packet is found, the state machine resets itself to begin
accumulating the next packet.
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Payload</h3>
<div class="outline-text-3" id="text-2-2">

<p>To describe the encoding of an object we consider how an object is
decoded. The first step in decoding binary data is to read a <a href="#sec-2-3">BINARY-TYPE</a> from the data. A binary type identifies the type of object
that has been encoded and the routine for decoding the object. The
binary representation of the object immediately follows the binary
type data. This two step decoding process is performed by the function
<code>DECODE-OBJECT</code>. 
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">flexi-streams:with-input-from-sequence</span> (in payload)
  (decode-object in))
</pre>


<p>
The encoding of the object is performed by the function
<code>ENCODE-OBJECT</code>.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defun</span> <span style="color: #0000ff;">encode-object</span> (stream object <span style="color: #228b22;">&amp;key</span> binary-type))
</pre>

<p>
This function accepts a <code>BINARY-TYPE</code> argument to specify which binary
type is to be used to encode <code>OBJECT</code>. If no <code>BINARY-TYPE</code> argument is
specified, then it is obtained using the generic function
<code>BINARY-TYPE-FOR-OBJECT</code>.
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Binary Types</h3>
<div class="outline-text-3" id="text-2-3">

<p>A binary type is a symbol that is used to identify the type of object
encoded in a stream. Associated with the symbol are routines for
reading and writing the binary representation of an object.
</p>
<p>
A new <code>BINARY-TYPE</code> can be defined using <code>DEFINE-BINARY-TYPE</code>.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">define-binary-type</span> example-type ()
  (<span style="color: #483d8b;">:reader</span> (in)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Read bytes from IN to produce the object</span>
    )
  (<span style="color: #483d8b;">:writer</span> (out value)
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">Write a binary representation of VALUE to OUT.</span>
    ))
</pre>

<p>
The reader and writer routines for binary types can be invoked using
the functions <code>READ-VALUE</code> and <code>WRITE-VALUE</code> . More information on
defining binary types can be obtained from the
<code>COM.GIGAMONKEYS.BINARY-DATA</code> <a href="http://www.gigamonkeys.com/book/practical-parsing-binary-files.html">documentation</a>.
</p>
<p>
A number of built-in binary types are exported by this library. These
types can be found by searching for exported symbols starting with
<code>BINARY-</code>. A subset of the types defined are
</p><ul>
<li><code>BINARY-UINT8</code> through to <code>BINARY-UINT64</code>.
</li>
<li><code>BINARY-INT8</code> through to <code>BINARY-INT64</code>.
</li>
<li><code>BINARY-SINGLE-FLOAT</code> and <code>BINARY-DOUBLE-FLOAT</code>.
</li>
<li><code>BINARY-UTF8-STRING</code>.
</li>
<li><code>BINARY-KEYWORD</code>.
</li>
<li><code>BINARY-SYMBOL</code>.
</li>
<li><code>BINARY-CONS</code>.
</li>
</ul>


<p>
There are two special binary types, <code>BINARY-TYPE</code> and <code>BINARY-OBJECT</code>,
that are exported by this library. The binary type <code>BINARY-TYPE</code>
performs the encoding of the binary type symbol used to identify
objects in the payload. The routines defined for the type
<code>BINARY-OBJECT</code> is synonymous with the routines <code>DECODE-OBJECT</code> and
<code>ENCODE-OBJECT</code>.
</p>
<p>
Once a binary type and its routines are defined, it can be associated
with object types using the generic function <code>BINARY-TYPE-FOR-OBJECT</code>.
</p>


<pre class="src src-lisp">(<span style="color: #7f007f;">defgeneric</span> <span style="color: #0000ff;">binary-type-for-object</span> (object)
  (<span style="color: #483d8b;">:documentation</span> <span style="color: #8b2252;">"Return the symbol of the binary type to use for OBJECT."</span>))
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-03 20:08:23 EST</p>
<p class="author">Author: Mark Cox</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
